betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_smc.h
/**
  *
  * @file    apm32f4xx_ddl_smc.h
  * @brief   Header file of SMC DDL module.
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification, 
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2016 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef APM32F4xx_DDL_SMC_H
#define APM32F4xx_DDL_SMC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_dal_def.h"

/** @addtogroup APM32F4xx_DAL_Driver
  * @{
  */

/** @addtogroup SMC_DDL
  * @{
  */

/** @addtogroup SMC_DDL_Private_Macros
  * @{
  */
#if defined(SMC_Bank1)

#define IS_SMC_NORSRAM_BANK(__BANK__) (((__BANK__) == SMC_NORSRAM_BANK1) || \
                                       ((__BANK__) == SMC_NORSRAM_BANK2) || \
                                       ((__BANK__) == SMC_NORSRAM_BANK3) || \
                                       ((__BANK__) == SMC_NORSRAM_BANK4))
#define IS_SMC_MUX(__MUX__) (((__MUX__) == SMC_DATA_ADDRESS_MUX_DISABLE) || \
                             ((__MUX__) == SMC_DATA_ADDRESS_MUX_ENABLE))
#define IS_SMC_MEMORY(__MEMORY__) (((__MEMORY__) == SMC_MEMORY_TYPE_SRAM) || \
                                   ((__MEMORY__) == SMC_MEMORY_TYPE_PSRAM)|| \
                                   ((__MEMORY__) == SMC_MEMORY_TYPE_NOR))
#define IS_SMC_NORSRAM_MEMORY_WIDTH(__WIDTH__) (((__WIDTH__) == SMC_NORSRAM_MEM_BUS_WIDTH_8)  || \
                                                ((__WIDTH__) == SMC_NORSRAM_MEM_BUS_WIDTH_16) || \
                                                ((__WIDTH__) == SMC_NORSRAM_MEM_BUS_WIDTH_32))
#define IS_SMC_PAGESIZE(__SIZE__) (((__SIZE__) == SMC_PAGE_SIZE_NONE) || \
                                   ((__SIZE__) == SMC_PAGE_SIZE_128) || \
                                   ((__SIZE__) == SMC_PAGE_SIZE_256) || \
                                   ((__SIZE__) == SMC_PAGE_SIZE_512) || \
                                   ((__SIZE__) == SMC_PAGE_SIZE_1024))
#if defined(SMC_CSCTRL1_WFDIS)
#define IS_SMC_WRITE_FIFO(__FIFO__) (((__FIFO__) == SMC_WRITE_FIFO_DISABLE) || \
                                     ((__FIFO__) == SMC_WRITE_FIFO_ENABLE))
#endif /* SMC_CSCTRL1_WFDIS */
#define IS_SMC_ACCESS_MODE(__MODE__) (((__MODE__) == SMC_ACCESS_MODE_A) || \
                                      ((__MODE__) == SMC_ACCESS_MODE_B) || \
                                      ((__MODE__) == SMC_ACCESS_MODE_C) || \
                                      ((__MODE__) == SMC_ACCESS_MODE_D))
#define IS_SMC_BURSTMODE(__STATE__) (((__STATE__) == SMC_BURST_ACCESS_MODE_DISABLE) || \
                                     ((__STATE__) == SMC_BURST_ACCESS_MODE_ENABLE))
#define IS_SMC_WAIT_POLARITY(__POLARITY__) (((__POLARITY__) == SMC_WAIT_SIGNAL_POLARITY_LOW) || \
                                            ((__POLARITY__) == SMC_WAIT_SIGNAL_POLARITY_HIGH))
#define IS_SMC_WRAP_MODE(__MODE__) (((__MODE__) == SMC_WRAP_MODE_DISABLE) || \
                                             ((__MODE__) == SMC_WRAP_MODE_ENABLE))
#define IS_SMC_WAIT_SIGNAL_ACTIVE(__ACTIVE__) (((__ACTIVE__) == SMC_WAIT_TIMING_BEFORE_WS) || \
                                               ((__ACTIVE__) == SMC_WAIT_TIMING_DURING_WS))
#define IS_SMC_WRITE_OPERATION(__OPERATION__) (((__OPERATION__) == SMC_WRITE_OPERATION_DISABLE) || \
                                               ((__OPERATION__) == SMC_WRITE_OPERATION_ENABLE))
#define IS_SMC_WAITE_SIGNAL(__SIGNAL__) (((__SIGNAL__) == SMC_WAIT_SIGNAL_DISABLE) || \
                                         ((__SIGNAL__) == SMC_WAIT_SIGNAL_ENABLE))
#define IS_SMC_EXTENDED_MODE(__MODE__) (((__MODE__) == SMC_EXTENDED_MODE_DISABLE) || \
                                        ((__MODE__) == SMC_EXTENDED_MODE_ENABLE))
#define IS_SMC_ASYNWAIT(__STATE__) (((__STATE__) == SMC_ASYNCHRONOUS_WAIT_DISABLE) || \
                                    ((__STATE__) == SMC_ASYNCHRONOUS_WAIT_ENABLE))
#define IS_SMC_DATA_LATENCY(__LATENCY__) (((__LATENCY__) > 1U) && ((__LATENCY__) <= 17U))
#define IS_SMC_WRITE_BURST(__BURST__) (((__BURST__) == SMC_WRITE_BURST_DISABLE) || \
                                       ((__BURST__) == SMC_WRITE_BURST_ENABLE))
#define IS_SMC_CONTINOUS_CLOCK(__CCLOCK__) (((__CCLOCK__) == SMC_CONTINUOUS_CLOCK_SYNC_ONLY) || \
                                            ((__CCLOCK__) == SMC_CONTINUOUS_CLOCK_SYNC_ASYNC))
#define IS_SMC_ADDRESS_SETUP_TIME(__TIME__) ((__TIME__) <= 15U)
#define IS_SMC_ADDRESS_HOLD_TIME(__TIME__) (((__TIME__) > 0U) && ((__TIME__) <= 15U))
#define IS_SMC_DATASETUP_TIME(__TIME__) (((__TIME__) > 0U) && ((__TIME__) <= 255U))
#define IS_SMC_DATAHOLD_DURATION(__DATAHOLD__) ((__DATAHOLD__) <= 3U)
#define IS_SMC_TURNAROUND_TIME(__TIME__) ((__TIME__) <= 15U)
#define IS_SMC_CLK_DIV(__DIV__) (((__DIV__) > 1U) && ((__DIV__) <= 16U))
#define IS_SMC_NORSRAM_DEVICE(__INSTANCE__) ((__INSTANCE__) == SMC_NORSRAM_DEVICE)
#define IS_SMC_NORSRAM_EXTENDED_DEVICE(__INSTANCE__) ((__INSTANCE__) == SMC_NORSRAM_EXTENDED_DEVICE)

#endif /* SMC_Bank1 */
#if  defined(SMC_Bank2_3)

