betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_smc.h
#define IS_SMC_NAND_BANK(__BANK__) (((__BANK__) == SMC_NAND_BANK2) || \
                                            ((__BANK__) == SMC_NAND_BANK3))
#define IS_SMC_WAIT_FEATURE(__FEATURE__) (((__FEATURE__) == SMC_NAND_PCC_WAIT_FEATURE_DISABLE) || \
                                                   ((__FEATURE__) == SMC_NAND_PCC_WAIT_FEATURE_ENABLE))
#define IS_SMC_NAND_MEMORY_WIDTH(__WIDTH__) (((__WIDTH__) == SMC_NAND_PCC_MEM_BUS_WIDTH_8) || \
                                                      ((__WIDTH__) == SMC_NAND_PCC_MEM_BUS_WIDTH_16))
#define IS_SMC_ECC_STATE(__STATE__) (((__STATE__) == SMC_NAND_ECC_DISABLE) || \
                                     ((__STATE__) == SMC_NAND_ECC_ENABLE))

#define IS_SMC_ECCPAGE_SIZE(__SIZE__) (((__SIZE__) == SMC_NAND_ECC_PAGE_SIZE_256BYTE)  || \
                                       ((__SIZE__) == SMC_NAND_ECC_PAGE_SIZE_512BYTE)  || \
                                       ((__SIZE__) == SMC_NAND_ECC_PAGE_SIZE_1024BYTE) || \
                                       ((__SIZE__) == SMC_NAND_ECC_PAGE_SIZE_2048BYTE) || \
                                       ((__SIZE__) == SMC_NAND_ECC_PAGE_SIZE_4096BYTE) || \
                                       ((__SIZE__) == SMC_NAND_ECC_PAGE_SIZE_8192BYTE))
#define IS_SMC_TCLR_TIME(__TIME__) ((__TIME__) <= 255U)
#define IS_SMC_TAR_TIME(__TIME__) ((__TIME__) <= 255U)
#define IS_SMC_SETUP_TIME(__TIME__) ((__TIME__) <= 254U)
#define IS_SMC_WAIT_TIME(__TIME__) ((__TIME__) <= 254U)
#define IS_SMC_HOLD_TIME(__TIME__) ((__TIME__) <= 254U)
#define IS_SMC_HIZ_TIME(__TIME__) ((__TIME__) <= 254U)
#define IS_SMC_NAND_DEVICE(__INSTANCE__) ((__INSTANCE__) == SMC_NAND_DEVICE)

#endif /* SMC_Bank2_3 */
#if defined(SMC_Bank4)
#define IS_SMC_PCCARD_DEVICE(__INSTANCE__) ((__INSTANCE__) == SMC_PCCARD_DEVICE)

#endif /* SMC_Bank4 */

/**
  * @}
  */

/* Exported typedef ----------------------------------------------------------*/

/** @defgroup SMC_DDL_Exported_typedef SMC Low Layer Exported Types
  * @{
  */

#if defined(SMC_Bank1)
#define SMC_NORSRAM_TypeDef            SMC_Bank1_TypeDef
#define SMC_NORSRAM_EXTENDED_TypeDef   SMC_Bank1E_TypeDef
#endif /* SMC_Bank1 */
#if defined(SMC_Bank2_3)
#define SMC_NAND_TypeDef               SMC_Bank2_3_TypeDef
#endif /* SMC_Bank2_3 */
#if defined(SMC_Bank4)
#define SMC_PCCARD_TypeDef             SMC_Bank4_TypeDef
#endif /* SMC_Bank4 */

#if defined(SMC_Bank1)
#define SMC_NORSRAM_DEVICE             SMC_Bank1
#define SMC_NORSRAM_EXTENDED_DEVICE    SMC_Bank1E
#endif /* SMC_Bank1 */
#if defined(SMC_Bank2_3)
#define SMC_NAND_DEVICE                SMC_Bank2_3
#endif /* SMC_Bank2_3 */
#if defined(SMC_Bank4)
#define SMC_PCCARD_DEVICE              SMC_Bank4
#endif /* SMC_Bank4 */

#if defined(SMC_Bank1)
/**
  * @brief  SMC NORSRAM Configuration Structure definition
  */
typedef struct
{
  uint32_t NSBank;                       /*!< Specifies the NORSRAM memory device that will be used.
                                              This parameter can be a value of @ref SMC_NORSRAM_Bank                  */

  uint32_t DataAddressMux;               /*!< Specifies whether the address and data values are
                                              multiplexed on the data bus or not.
                                              This parameter can be a value of @ref SMC_Data_Address_Bus_Multiplexing */

  uint32_t MemoryType;                   /*!< Specifies the type of external memory attached to
                                              the corresponding memory device.
                                              This parameter can be a value of @ref SMC_Memory_Type                   */

  uint32_t MemoryDataWidth;              /*!< Specifies the external memory device width.
                                              This parameter can be a value of @ref SMC_NORSRAM_Data_Width            */

  uint32_t BurstAccessMode;              /*!< Enables or disables the burst access mode for Flash memory,
                                              valid only with synchronous burst Flash memories.
                                              This parameter can be a value of @ref SMC_Burst_Access_Mode             */

  uint32_t WaitSignalPolarity;           /*!< Specifies the wait signal polarity, valid only when accessing
                                              the Flash memory in burst mode.
                                              This parameter can be a value of @ref SMC_Wait_Signal_Polarity          */

  uint32_t WrapMode;                     /*!< Enables or disables the Wrapped burst access mode for Flash
                                              memory, valid only when accessing Flash memories in burst mode.
                                              This parameter can be a value of @ref SMC_Wrap_Mode
                                              This mode is available only for the APM32F405/407/417xx devices             */

  uint32_t WaitSignalActive;             /*!< Specifies if the wait signal is asserted by the memory one
                                              clock cycle before the wait state or during the wait state,
                                              valid only when accessing memories in burst mode.
                                              This parameter can be a value of @ref SMC_Wait_Timing                   */

  uint32_t WriteOperation;               /*!< Enables or disables the write operation in the selected device by the SMC.
                                              This parameter can be a value of @ref SMC_Write_Operation               */

  uint32_t WaitSignal;                   /*!< Enables or disables the wait state insertion via wait
                                              signal, valid for Flash memory access in burst mode.
                                              This parameter can be a value of @ref SMC_Wait_Signal                   */

  uint32_t ExtendedMode;                 /*!< Enables or disables the extended mode.
                                              This parameter can be a value of @ref SMC_Extended_Mode                 */

  uint32_t AsynchronousWait;             /*!< Enables or disables wait signal during asynchronous transfers,
                                              valid only with asynchronous Flash memories.
                                              This parameter can be a value of @ref SMC_AsynchronousWait              */

  uint32_t WriteBurst;                   /*!< Enables or disables the write burst operation.
                                              This parameter can be a value of @ref SMC_Write_Burst                   */

