betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_smc.h
  uint32_t TARSetupTime;           /*!< Defines the number of HCLK cycles to configure the
                                        delay between ALE low and RE low.
                                        This parameter can be a number between Min_Data = 0 and Max_Data = 255 */
} SMC_NAND_InitTypeDef;
#endif

#if defined(SMC_Bank2_3) || defined(SMC_Bank4)
/**
  * @brief  SMC NAND Timing parameters structure definition
  */
typedef struct
{
  uint32_t SetupTime;            /*!< Defines the number of HCLK cycles to setup address before
                                      the command assertion for NAND-Flash read or write access
                                      to common/Attribute or I/O memory space (depending on
                                      the memory space timing to be configured).
                                      This parameter can be a value between Min_Data = 0 and Max_Data = 254    */

  uint32_t WaitSetupTime;        /*!< Defines the minimum number of HCLK cycles to assert the
                                      command for NAND-Flash read or write access to
                                      common/Attribute or I/O memory space (depending on the
                                      memory space timing to be configured).
                                      This parameter can be a number between Min_Data = 0 and Max_Data = 254   */

  uint32_t HoldSetupTime;        /*!< Defines the number of HCLK clock cycles to hold address
                                      (and data for write access) after the command de-assertion
                                      for NAND-Flash read or write access to common/Attribute
                                      or I/O memory space (depending on the memory space timing
                                      to be configured).
                                      This parameter can be a number between Min_Data = 0 and Max_Data = 254   */

  uint32_t HiZSetupTime;         /*!< Defines the number of HCLK clock cycles during which the
                                      data bus is kept in HiZ after the start of a NAND-Flash
                                      write access to common/Attribute or I/O memory space (depending
                                      on the memory space timing to be configured).
                                      This parameter can be a number between Min_Data = 0 and Max_Data = 254   */
} SMC_NAND_PCC_TimingTypeDef;
#endif /* SMC_Bank2_3 */

#if defined(SMC_Bank4)
/**
  * @brief SMC PCCARD Configuration Structure definition
  */
typedef struct
{
  uint32_t Waitfeature;            /*!< Enables or disables the Wait feature for the PCCARD Memory device.
                                        This parameter can be any value of @ref SMC_Wait_feature      */

  uint32_t TCLRSetupTime;          /*!< Defines the number of HCLK cycles to configure the
                                        delay between CLE low and RE low.
                                        This parameter can be a value between Min_Data = 0 and Max_Data = 255  */

  uint32_t TARSetupTime;           /*!< Defines the number of HCLK cycles to configure the
                                        delay between ALE low and RE low.
                                        This parameter can be a number between Min_Data = 0 and Max_Data = 255 */
}SMC_PCCARD_InitTypeDef;
#endif /* SMC_Bank4 */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @addtogroup SMC_DDL_Exported_Constants SMC Low Layer Exported Constants
  * @{
  */
#if defined(SMC_Bank1)

/** @defgroup SMC_DDL_NOR_SRAM_Controller SMC NOR/SRAM Controller
  * @{
  */

/** @defgroup SMC_NORSRAM_Bank SMC NOR/SRAM Bank
  * @{
  */
#define SMC_NORSRAM_BANK1                       (0x00000000U)
#define SMC_NORSRAM_BANK2                       (0x00000002U)
#define SMC_NORSRAM_BANK3                       (0x00000004U)
#define SMC_NORSRAM_BANK4                       (0x00000006U)
/**
  * @}
  */

/** @defgroup SMC_Data_Address_Bus_Multiplexing SMC Data Address Bus Multiplexing
  * @{
  */
#define SMC_DATA_ADDRESS_MUX_DISABLE            (0x00000000U)
#define SMC_DATA_ADDRESS_MUX_ENABLE             (0x00000002U)
/**
  * @}
  */

/** @defgroup SMC_Memory_Type SMC Memory Type
  * @{
  */
#define SMC_MEMORY_TYPE_SRAM                    (0x00000000U)
#define SMC_MEMORY_TYPE_PSRAM                   (0x00000004U)
#define SMC_MEMORY_TYPE_NOR                     (0x00000008U)
/**
  * @}
  */

/** @defgroup SMC_NORSRAM_Data_Width SMC NORSRAM Data Width
  * @{
  */
#define SMC_NORSRAM_MEM_BUS_WIDTH_8             (0x00000000U)
#define SMC_NORSRAM_MEM_BUS_WIDTH_16            (0x00000010U)
#define SMC_NORSRAM_MEM_BUS_WIDTH_32            (0x00000020U)
/**
  * @}
  */

/** @defgroup SMC_NORSRAM_Flash_Access SMC NOR/SRAM Flash Access
  * @{
  */
#define SMC_NORSRAM_FLASH_ACCESS_ENABLE         (0x00000040U)
#define SMC_NORSRAM_FLASH_ACCESS_DISABLE        (0x00000000U)
/**
  * @}
  */

/** @defgroup SMC_Burst_Access_Mode SMC Burst Access Mode
  * @{
  */
#define SMC_BURST_ACCESS_MODE_DISABLE           (0x00000000U)
#define SMC_BURST_ACCESS_MODE_ENABLE            (0x00000100U)
/**
  * @}
  */

/** @defgroup SMC_Wait_Signal_Polarity SMC Wait Signal Polarity
  * @{
  */
#define SMC_WAIT_SIGNAL_POLARITY_LOW            (0x00000000U)
#define SMC_WAIT_SIGNAL_POLARITY_HIGH           (0x00000200U)
/**
  * @}
  */

/** @defgroup SMC_Wrap_Mode SMC Wrap Mode
  * @note  These values are available only for the APM32F405/407/417xx devices.
  * @{
  */
#define SMC_WRAP_MODE_DISABLE                   (0x00000000U)
#define SMC_WRAP_MODE_ENABLE                    (0x00000400U)
/**
  * @}
  */

/** @defgroup SMC_Wait_Timing SMC Wait Timing
  * @{
  */
#define SMC_WAIT_TIMING_BEFORE_WS               (0x00000000U)
#define SMC_WAIT_TIMING_DURING_WS               (0x00000800U)
/**
  * @}
  */

/** @defgroup SMC_Write_Operation SMC Write Operation
  * @{
  */
#define SMC_WRITE_OPERATION_DISABLE             (0x00000000U)
#define SMC_WRITE_OPERATION_ENABLE              (0x00001000U)
/**
  * @}
  */

/** @defgroup SMC_Wait_Signal SMC Wait Signal
  * @{
  */
#define SMC_WAIT_SIGNAL_DISABLE                 (0x00000000U)
#define SMC_WAIT_SIGNAL_ENABLE                  (0x00002000U)
/**
  * @}
  */

/** @defgroup SMC_Extended_Mode SMC Extended Mode
  * @{
  */
#define SMC_EXTENDED_MODE_DISABLE               (0x00000000U)
#define SMC_EXTENDED_MODE_ENABLE                (0x00004000U)
/**
  * @}
  */

/** @defgroup SMC_AsynchronousWait SMC Asynchronous Wait
  * @{
  */
#define SMC_ASYNCHRONOUS_WAIT_DISABLE           (0x00000000U)
#define SMC_ASYNCHRONOUS_WAIT_ENABLE            (0x00008000U)
/**
  * @}
  */

/** @defgroup SMC_Page_Size SMC Page Size
  * @{
  */
#define SMC_PAGE_SIZE_NONE                      (0x00000000U)
#define SMC_PAGE_SIZE_128                       SMC_CSCTRL1_CRAMPSIZECFG_0
#define SMC_PAGE_SIZE_256                       SMC_CSCTRL1_CRAMPSIZECFG_1
#define SMC_PAGE_SIZE_512                       (SMC_CSCTRL1_CRAMPSIZECFG_0\
                                                 | SMC_CSCTRL1_CRAMPSIZECFG_1)
#define SMC_PAGE_SIZE_1024                      SMC_CSCTRL1_CRAMPSIZECFG_2
/**
  * @}
  */

/** @defgroup SMC_Write_Burst SMC Write Burst
  * @{
  */
#define SMC_WRITE_BURST_DISABLE                 (0x00000000U)
#define SMC_WRITE_BURST_ENABLE                  (0x00080000U)
/**
  * @}
  */

/** @defgroup SMC_Continous_Clock SMC Continuous Clock
  * @note  These values are available only for the APM32F412Vx/Zx/Rx devices.
  * @{
  */
#define SMC_CONTINUOUS_CLOCK_SYNC_ONLY          (0x00000000U)
#define SMC_CONTINUOUS_CLOCK_SYNC_ASYNC         (0x00100000U)
/**
  * @}
  */

