betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_smc.h
#if defined(SMC_CSCTRL1_WFDIS)
/** @defgroup SMC_Write_FIFO SMC Write FIFO
  * @note  These values are available only for the APM32F412Vx/Zx/Rx devices.
  * @{
  */
#define SMC_WRITE_FIFO_DISABLE                  SMC_CSCTRL1_WFDIS
#define SMC_WRITE_FIFO_ENABLE                   (0x00000000U)
#endif /* SMC_CSCTRL1_WFDIS */
/**
  * @}
  */

/** @defgroup SMC_Access_Mode SMC Access Mode
  * @{
  */
#define SMC_ACCESS_MODE_A                       (0x00000000U)
#define SMC_ACCESS_MODE_B                       (0x10000000U)
#define SMC_ACCESS_MODE_C                       (0x20000000U)
#define SMC_ACCESS_MODE_D                       (0x30000000U)
/**
  * @}
  */

/**
  * @}
  */
#endif /* SMC_Bank1 */

#if defined(SMC_Bank2_3) || defined(SMC_Bank4)

/** @defgroup SMC_DDL_NAND_Controller SMC NAND Controller
  * @{
  */
/** @defgroup SMC_NAND_Bank SMC NAND Bank
  * @{
  */
#if defined(SMC_Bank2_3)
#define SMC_NAND_BANK2                          (0x00000010U)
#endif
#define SMC_NAND_BANK3                          (0x00000100U)
/**
  * @}
  */

/** @defgroup SMC_Wait_feature SMC Wait feature
  * @{
  */
#define SMC_NAND_PCC_WAIT_FEATURE_DISABLE       (0x00000000U)
#define SMC_NAND_PCC_WAIT_FEATURE_ENABLE        (0x00000002U)
/**
  * @}
  */

/** @defgroup SMC_PCR_Memory_Type SMC PCR Memory Type
  * @{
  */
#if defined(SMC_Bank4)
#define SMC_PCR_MEMORY_TYPE_PCCARD              (0x00000000U)
#endif /* SMC_Bank4 */
#define SMC_PCR_MEMORY_TYPE_NAND                (0x00000008U)
/**
  * @}
  */

/** @defgroup SMC_NAND_Data_Width SMC NAND Data Width
  * @{
  */
#define SMC_NAND_PCC_MEM_BUS_WIDTH_8            (0x00000000U)
#define SMC_NAND_PCC_MEM_BUS_WIDTH_16           (0x00000010U)
/**
  * @}
  */

/** @defgroup SMC_ECC SMC ECC
  * @{
  */
#define SMC_NAND_ECC_DISABLE                    (0x00000000U)
#define SMC_NAND_ECC_ENABLE                     (0x00000040U)
/**
  * @}
  */

/** @defgroup SMC_ECC_Page_Size SMC ECC Page Size
  * @{
  */
#define SMC_NAND_ECC_PAGE_SIZE_256BYTE          (0x00000000U)
#define SMC_NAND_ECC_PAGE_SIZE_512BYTE          (0x00020000U)
#define SMC_NAND_ECC_PAGE_SIZE_1024BYTE         (0x00040000U)
#define SMC_NAND_ECC_PAGE_SIZE_2048BYTE         (0x00060000U)
#define SMC_NAND_ECC_PAGE_SIZE_4096BYTE         (0x00080000U)
#define SMC_NAND_ECC_PAGE_SIZE_8192BYTE         (0x000A0000U)
/**
  * @}
  */

/**
  * @}
  */
#endif /* SMC_Bank2_3 || SMC_Bank4 */


/** @defgroup SMC_DDL_Interrupt_definition SMC Low Layer Interrupt definition
  * @{
  */
#if defined(SMC_Bank2_3) || defined(SMC_Bank4)
#define SMC_IT_RISING_EDGE                      (0x00000008U)
#define SMC_IT_LEVEL                            (0x00000010U)
#define SMC_IT_FALLING_EDGE                     (0x00000020U)
#endif /* SMC_Bank2_3 || SMC_Bank4 */
/**
  * @}
  */

/** @defgroup SMC_DDL_Flag_definition SMC Low Layer Flag definition
  * @{
  */
#if defined(SMC_Bank2_3) || defined(SMC_Bank4)
#define SMC_FLAG_RISING_EDGE                    (0x00000001U)
#define SMC_FLAG_LEVEL                          (0x00000002U)
#define SMC_FLAG_FALLING_EDGE                   (0x00000004U)
#define SMC_FLAG_FEMPT                          (0x00000040U)
#endif /* SMC_Bank2_3 || SMC_Bank4 */
/**
  * @}
  */

/** @defgroup SMC_DDL_Alias_definition  SMC Alias definition
  * @{
  */
#define FMC_WRITE_OPERATION_DISABLE          SMC_WRITE_OPERATION_DISABLE
#define FMC_WRITE_OPERATION_ENABLE           SMC_WRITE_OPERATION_ENABLE

#define FMC_NORSRAM_MEM_BUS_WIDTH_8           SMC_NORSRAM_MEM_BUS_WIDTH_8
#define FMC_NORSRAM_MEM_BUS_WIDTH_16          SMC_NORSRAM_MEM_BUS_WIDTH_16
#define FMC_NORSRAM_MEM_BUS_WIDTH_32          SMC_NORSRAM_MEM_BUS_WIDTH_32

#define FMC_NORSRAM_TypeDef                   SMC_NORSRAM_TypeDef
#define FMC_NORSRAM_EXTENDED_TypeDef          SMC_NORSRAM_EXTENDED_TypeDef
#define FMC_NORSRAM_InitTypeDef               SMC_NORSRAM_InitTypeDef
#define FMC_NORSRAM_TimingTypeDef             SMC_NORSRAM_TimingTypeDef

#define FMC_NORSRAM_Init                      SMC_NORSRAM_Init
#define FMC_NORSRAM_Timing_Init               SMC_NORSRAM_Timing_Init
#define FMC_NORSRAM_Extended_Timing_Init      SMC_NORSRAM_Extended_Timing_Init
#define FMC_NORSRAM_DeInit                    SMC_NORSRAM_DeInit
#define FMC_NORSRAM_WriteOperation_Enable     SMC_NORSRAM_WriteOperation_Enable
#define FMC_NORSRAM_WriteOperation_Disable    SMC_NORSRAM_WriteOperation_Disable

#define __FMC_NORSRAM_ENABLE                  __SMC_NORSRAM_ENABLE
#define __FMC_NORSRAM_DISABLE                 __SMC_NORSRAM_DISABLE

#define FMC_NAND_InitTypeDef                  SMC_NAND_InitTypeDef
#define FMC_PCCARD_InitTypeDef                SMC_PCCARD_InitTypeDef
#define FMC_NAND_PCC_TimingTypeDef            SMC_NAND_PCC_TimingTypeDef

#define FMC_NAND_Init                         SMC_NAND_Init
#define FMC_NAND_CommonSpace_Timing_Init      SMC_NAND_CommonSpace_Timing_Init
#define FMC_NAND_AttributeSpace_Timing_Init   SMC_NAND_AttributeSpace_Timing_Init
#define FMC_NAND_DeInit                       SMC_NAND_DeInit
#define FMC_NAND_ECC_Enable                   SMC_NAND_ECC_Enable
#define FMC_NAND_ECC_Disable                  SMC_NAND_ECC_Disable
#define FMC_NAND_GetECC                       SMC_NAND_GetECC
#define FMC_PCCARD_Init                       SMC_PCCARD_Init
#define FMC_PCCARD_CommonSpace_Timing_Init    SMC_PCCARD_CommonSpace_Timing_Init
#define FMC_PCCARD_AttributeSpace_Timing_Init SMC_PCCARD_AttributeSpace_Timing_Init
#define FMC_PCCARD_IOSpace_Timing_Init        SMC_PCCARD_IOSpace_Timing_Init
#define FMC_PCCARD_DeInit                     SMC_PCCARD_DeInit

#define __FMC_NAND_ENABLE                     __SMC_NAND_ENABLE
#define __FMC_NAND_DISABLE                    __SMC_NAND_DISABLE
#define __FMC_PCCARD_ENABLE                   __SMC_PCCARD_ENABLE
#define __FMC_PCCARD_DISABLE                  __SMC_PCCARD_DISABLE
#define __FMC_NAND_ENABLE_IT                  __SMC_NAND_ENABLE_IT
#define __FMC_NAND_DISABLE_IT                 __SMC_NAND_DISABLE_IT
#define __FMC_NAND_GET_FLAG                   __SMC_NAND_GET_FLAG
#define __FMC_NAND_CLEAR_FLAG                 __SMC_NAND_CLEAR_FLAG
#define __FMC_PCCARD_ENABLE_IT                __SMC_PCCARD_ENABLE_IT
#define __FMC_PCCARD_DISABLE_IT               __SMC_PCCARD_DISABLE_IT
#define __FMC_PCCARD_GET_FLAG                 __SMC_PCCARD_GET_FLAG
#define __FMC_PCCARD_CLEAR_FLAG               __SMC_PCCARD_CLEAR_FLAG

