betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_smc.h
#define FMC_NORSRAM_TypeDef                   SMC_NORSRAM_TypeDef
#define FMC_NORSRAM_EXTENDED_TypeDef          SMC_NORSRAM_EXTENDED_TypeDef
#define FMC_NAND_TypeDef                      SMC_NAND_TypeDef
#define FMC_PCCARD_TypeDef                    SMC_PCCARD_TypeDef

#define FMC_NORSRAM_DEVICE                    SMC_NORSRAM_DEVICE
#define FMC_NORSRAM_EXTENDED_DEVICE           SMC_NORSRAM_EXTENDED_DEVICE
#define FMC_NAND_DEVICE                       SMC_NAND_DEVICE
#define FMC_PCCARD_DEVICE                     SMC_PCCARD_DEVICE

#define FMC_NAND_BANK2                        SMC_NAND_BANK2

#define FMC_NORSRAM_BANK1                     SMC_NORSRAM_BANK1
#define FMC_NORSRAM_BANK2                     SMC_NORSRAM_BANK2
#define FMC_NORSRAM_BANK3                     SMC_NORSRAM_BANK3

#define FMC_IT_RISING_EDGE                    SMC_IT_RISING_EDGE
#define FMC_IT_LEVEL                          SMC_IT_LEVEL
#define FMC_IT_FALLING_EDGE                   SMC_IT_FALLING_EDGE
#define FMC_IT_REFRESH_ERROR                  SMC_IT_REFRESH_ERROR

#define FMC_FLAG_RISING_EDGE                  SMC_FLAG_RISING_EDGE
#define FMC_FLAG_LEVEL                        SMC_FLAG_LEVEL
#define FMC_FLAG_FALLING_EDGE                 SMC_FLAG_FALLING_EDGE
#define FMC_FLAG_FEMPT                        SMC_FLAG_FEMPT
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/** @defgroup SMC_DDL_Private_Macros SMC_DDL  Private Macros
  * @{
  */
#if defined(SMC_Bank1)
/** @defgroup SMC_DDL_NOR_Macros SMC NOR/SRAM Macros
  * @brief macros to handle NOR device enable/disable and read/write operations
  * @{
  */

/**
  * @brief  Enable the NORSRAM device access.
  * @param  __INSTANCE__ SMC_NORSRAM Instance
  * @param  __BANK__ SMC_NORSRAM Bank
  * @retval None
  */
#define __SMC_NORSRAM_ENABLE(__INSTANCE__, __BANK__)  ((__INSTANCE__)->CSCTRL[(__BANK__)]\
                                                       |= SMC_CSCTRL1_MBKEN)

/**
  * @brief  Disable the NORSRAM device access.
  * @param  __INSTANCE__ SMC_NORSRAM Instance
  * @param  __BANK__ SMC_NORSRAM Bank
  * @retval None
  */
#define __SMC_NORSRAM_DISABLE(__INSTANCE__, __BANK__) ((__INSTANCE__)->CSCTRL[(__BANK__)]\
                                                       &= ~SMC_CSCTRL1_MBKEN)

/**
  * @}
  */
#endif /* SMC_Bank1 */

#if defined(SMC_Bank2_3)
/** @defgroup SMC_DDL_NAND_Macros SMC NAND Macros
  *  @brief macros to handle NAND device enable/disable
  *  @{
  */

/**
  * @brief  Enable the NAND device access.
  * @param  __INSTANCE__ SMC_NAND Instance
  * @param  __BANK__     SMC_NAND Bank
  * @retval None
  */
#define __SMC_NAND_ENABLE(__INSTANCE__, __BANK__)  (((__BANK__) == SMC_NAND_BANK2)? ((__INSTANCE__)->CTRL2 |= SMC_CTRL2_MBKEN): \
                                                             ((__INSTANCE__)->CTRL3 |= SMC_CTRL3_MBKEN))

/**
  * @brief  Disable the NAND device access.
  * @param  __INSTANCE__ SMC_NAND Instance
  * @param  __BANK__     SMC_NAND Bank
  * @retval None
  */
#define __SMC_NAND_DISABLE(__INSTANCE__, __BANK__) (((__BANK__) == SMC_NAND_BANK2)? CLEAR_BIT((__INSTANCE__)->CTRL2, SMC_CTRL2_MBKEN): \
                                                             CLEAR_BIT((__INSTANCE__)->CTRL3, SMC_CTRL3_MBKEN))

/**
  * @}
  */
#endif /* SMC_Bank2_3 */

#if defined(SMC_Bank4)
/** @defgroup SMC_DDL_PCCARD_Macros FMC PCCARD Macros
  *  @brief macros to handle PCCARD read/write operations
  *  @{
  */
/**
  * @brief  Enable the PCCARD device access.
  * @param  __INSTANCE__ SMC_PCCARD Instance
  * @retval None
  */
#define __SMC_PCCARD_ENABLE(__INSTANCE__)  ((__INSTANCE__)->CTRL4 |= SMC_CTRL4_MBKEN)

/**
  * @brief  Disable the PCCARD device access.
  * @param  __INSTANCE__ SMC_PCCARD Instance
  * @retval None
  */
#define __SMC_PCCARD_DISABLE(__INSTANCE__) ((__INSTANCE__)->CTRL4 &= ~SMC_CTRL4_MBKEN)
/**
  * @}
  */

#endif
#if defined(SMC_Bank2_3)
/** @defgroup SMC_DDL_NAND_Interrupt SMC NAND Interrupt
  * @brief macros to handle NAND interrupts
  * @{
  */

/**
  * @brief  Enable the NAND device interrupt.
  * @param  __INSTANCE__  SMC_NAND instance
  * @param  __BANK__     SMC_NAND Bank
  * @param  __INTERRUPT__ SMC_NAND interrupt
  *         This parameter can be any combination of the following values:
  *            @arg SMC_IT_RISING_EDGE: Interrupt rising edge.
  *            @arg SMC_IT_LEVEL: Interrupt level.
  *            @arg SMC_IT_FALLING_EDGE: Interrupt falling edge.
  * @retval None
  */
#define __SMC_NAND_ENABLE_IT(__INSTANCE__, __BANK__, __INTERRUPT__)  (((__BANK__) == SMC_NAND_BANK2)? ((__INSTANCE__)->STSINT2 |= (__INTERRUPT__)): \
                                                                               ((__INSTANCE__)->STSINT3 |= (__INTERRUPT__)))

/**
  * @brief  Disable the NAND device interrupt.
  * @param  __INSTANCE__  SMC_NAND Instance
  * @param  __BANK__     SMC_NAND Bank
  * @param  __INTERRUPT__ SMC_NAND interrupt
  *         This parameter can be any combination of the following values:
  *            @arg SMC_IT_RISING_EDGE: Interrupt rising edge.
  *            @arg SMC_IT_LEVEL: Interrupt level.
  *            @arg SMC_IT_FALLING_EDGE: Interrupt falling edge.
  * @retval None
  */
#define __SMC_NAND_DISABLE_IT(__INSTANCE__, __BANK__, __INTERRUPT__)  (((__BANK__) == SMC_NAND_BANK2)? ((__INSTANCE__)->STSINT2 &= ~(__INTERRUPT__)): \
                                                                                ((__INSTANCE__)->STSINT3 &= ~(__INTERRUPT__)))

/**
  * @brief  Get flag status of the NAND device.
  * @param  __INSTANCE__ SMC_NAND Instance
  * @param  __BANK__     SMC_NAND Bank
  * @param  __FLAG__     SMC_NAND flag
  *         This parameter can be any combination of the following values:
  *            @arg SMC_FLAG_RISING_EDGE: Interrupt rising edge flag.
  *            @arg SMC_FLAG_LEVEL: Interrupt level edge flag.
  *            @arg SMC_FLAG_FALLING_EDGE: Interrupt falling edge flag.
  *            @arg SMC_FLAG_FEMPT: FIFO empty flag.
  * @retval The state of FLAG (SET or RESET).
  */
#define __SMC_NAND_GET_FLAG(__INSTANCE__, __BANK__, __FLAG__)  (((__BANK__) == SMC_NAND_BANK2)? (((__INSTANCE__)->STSINT2 &(__FLAG__)) == (__FLAG__)): \
                                                                         (((__INSTANCE__)->STSINT3 &(__FLAG__)) == (__FLAG__)))

/**
  * @brief  Clear flag status of the NAND device.
  * @param  __INSTANCE__ SMC_NAND Instance
  * @param  __BANK__     SMC_NAND Bank
  * @param  __FLAG__     SMC_NAND flag
  *         This parameter can be any combination of the following values:
  *            @arg SMC_FLAG_RISING_EDGE: Interrupt rising edge flag.
  *            @arg SMC_FLAG_LEVEL: Interrupt level edge flag.
  *            @arg SMC_FLAG_FALLING_EDGE: Interrupt falling edge flag.
  *            @arg SMC_FLAG_FEMPT: FIFO empty flag.
  * @retval None
  */
#define __SMC_NAND_CLEAR_FLAG(__INSTANCE__, __BANK__, __FLAG__)  (((__BANK__) == SMC_NAND_BANK2)? ((__INSTANCE__)->STSINT2 &= ~(__FLAG__)): \
                                                                           ((__INSTANCE__)->STSINT3 &= ~(__FLAG__)))

/**
  * @}
  */
#endif /* SMC_Bank2_3 */

#if defined(SMC_Bank4)
/** @defgroup SMC_DDL_PCCARD_Interrupt SMC PCCARD Interrupt
  * @brief macros to handle PCCARD interrupts
  * @{
  */

/**
  * @brief  Enable the PCCARD device interrupt.
  * @param  __INSTANCE__ SMC_PCCARD instance
  * @param  __INTERRUPT__ SMC_PCCARD interrupt
  *         This parameter can be any combination of the following values:
  *            @arg SMC_IT_RISING_EDGE: Interrupt rising edge.
  *            @arg SMC_IT_LEVEL: Interrupt level.
  *            @arg SMC_IT_FALLING_EDGE: Interrupt falling edge.
  * @retval None
  */
#define __SMC_PCCARD_ENABLE_IT(__INSTANCE__, __INTERRUPT__)  ((__INSTANCE__)->STSINT4 |= (__INTERRUPT__))

/**
  * @brief  Disable the PCCARD device interrupt.
  * @param  __INSTANCE__ SMC_PCCARD instance
  * @param  __INTERRUPT__ SMC_PCCARD interrupt
  *         This parameter can be any combination of the following values:
  *            @arg SMC_IT_RISING_EDGE: Interrupt rising edge.
  *            @arg SMC_IT_LEVEL: Interrupt level.
  *            @arg SMC_IT_FALLING_EDGE: Interrupt falling edge.
  * @retval None
  */
#define __SMC_PCCARD_DISABLE_IT(__INSTANCE__, __INTERRUPT__)  ((__INSTANCE__)->STSINT4 &= ~(__INTERRUPT__))

/**
  * @brief  Get flag status of the PCCARD device.
  * @param  __INSTANCE__ SMC_PCCARD instance
  * @param  __FLAG__ SMC_PCCARD flag
  *         This parameter can be any combination of the following values:
  *            @arg  SMC_FLAG_RISING_EDGE: Interrupt rising edge flag.
  *            @arg  SMC_FLAG_LEVEL: Interrupt level edge flag.
  *            @arg  SMC_FLAG_FALLING_EDGE: Interrupt falling edge flag.
  *            @arg  SMC_FLAG_FEMPT: FIFO empty flag.
  * @retval The state of FLAG (SET or RESET).
  */
#define __SMC_PCCARD_GET_FLAG(__INSTANCE__, __FLAG__)  (((__INSTANCE__)->STSINT4 &(__FLAG__)) == (__FLAG__))

/**
  * @brief  Clear flag status of the PCCARD device.
  * @param  __INSTANCE__ SMC_PCCARD instance
  * @param  __FLAG__ SMC_PCCARD flag
  *         This parameter can be any combination of the following values:
  *            @arg  SMC_FLAG_RISING_EDGE: Interrupt rising edge flag.
  *            @arg  SMC_FLAG_LEVEL: Interrupt level edge flag.
  *            @arg  SMC_FLAG_FALLING_EDGE: Interrupt falling edge flag.
  *            @arg  SMC_FLAG_FEMPT: FIFO empty flag.
  * @retval None
  */
#define __SMC_PCCARD_CLEAR_FLAG(__INSTANCE__, __FLAG__)  ((__INSTANCE__)->STSINT4 &= ~(__FLAG__))

/**
  * @}
  */
#endif

/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup SMC_DDL_Private_Functions SMC DDL Private Functions
  *  @{
  */

#if defined(SMC_Bank1)
/** @defgroup SMC_DDL_NORSRAM  NOR SRAM
  *  @{
  */
/** @defgroup SMC_DDL_NORSRAM_Private_Functions_Group1 NOR SRAM Initialization/de-initialization functions
  *  @{
  */
DAL_StatusTypeDef  SMC_NORSRAM_Init(SMC_NORSRAM_TypeDef *Device,
                                    SMC_NORSRAM_InitTypeDef *Init);
DAL_StatusTypeDef  SMC_NORSRAM_Timing_Init(SMC_NORSRAM_TypeDef *Device,
                                           SMC_NORSRAM_TimingTypeDef *Timing, uint32_t Bank);
DAL_StatusTypeDef  SMC_NORSRAM_Extended_Timing_Init(SMC_NORSRAM_EXTENDED_TypeDef *Device,
                                                    SMC_NORSRAM_TimingTypeDef *Timing, uint32_t Bank,
                                                    uint32_t ExtendedMode);
DAL_StatusTypeDef  SMC_NORSRAM_DeInit(SMC_NORSRAM_TypeDef *Device,
                                      SMC_NORSRAM_EXTENDED_TypeDef *ExDevice, uint32_t Bank);
/**
  * @}
  */

