betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_smc.h
/** @defgroup SMC_DDL_NORSRAM_Private_Functions_Group2 NOR SRAM Control functions
  *  @{
  */
DAL_StatusTypeDef  SMC_NORSRAM_WriteOperation_Enable(SMC_NORSRAM_TypeDef *Device, uint32_t Bank);
DAL_StatusTypeDef  SMC_NORSRAM_WriteOperation_Disable(SMC_NORSRAM_TypeDef *Device, uint32_t Bank);
/**
  * @}
  */
/**
  * @}
  */
#endif /* SMC_Bank1 */

#if defined(SMC_Bank2_3)
/** @defgroup SMC_DDL_NAND NAND
  *  @{
  */
/** @defgroup SMC_DDL_NAND_Private_Functions_Group1 NAND Initialization/de-initialization functions
  *  @{
  */
DAL_StatusTypeDef  SMC_NAND_Init(SMC_NAND_TypeDef *Device, SMC_NAND_InitTypeDef *Init);
DAL_StatusTypeDef  SMC_NAND_CommonSpace_Timing_Init(SMC_NAND_TypeDef *Device,
                                                    SMC_NAND_PCC_TimingTypeDef *Timing, uint32_t Bank);
DAL_StatusTypeDef  SMC_NAND_AttributeSpace_Timing_Init(SMC_NAND_TypeDef *Device,
                                                       SMC_NAND_PCC_TimingTypeDef *Timing, uint32_t Bank);
DAL_StatusTypeDef  SMC_NAND_DeInit(SMC_NAND_TypeDef *Device, uint32_t Bank);
/**
  * @}
  */

/** @defgroup SMC_DDL_NAND_Private_Functions_Group2 NAND Control functions
  *  @{
  */
DAL_StatusTypeDef  SMC_NAND_ECC_Enable(SMC_NAND_TypeDef *Device, uint32_t Bank);
DAL_StatusTypeDef  SMC_NAND_ECC_Disable(SMC_NAND_TypeDef *Device, uint32_t Bank);
DAL_StatusTypeDef  SMC_NAND_GetECC(SMC_NAND_TypeDef *Device, uint32_t *ECCval, uint32_t Bank,
                                   uint32_t Timeout);
/**
  * @}
  */
/**
  * @}
  */
#endif /* SMC_Bank2_3 */

#if defined(SMC_Bank4)
/** @defgroup SMC_DDL_PCCARD PCCARD
  *  @{
  */
/** @defgroup SMC_DDL_PCCARD_Private_Functions_Group1 PCCARD Initialization/de-initialization functions
  *  @{
  */
DAL_StatusTypeDef  SMC_PCCARD_Init(SMC_PCCARD_TypeDef *Device, SMC_PCCARD_InitTypeDef *Init);
DAL_StatusTypeDef  SMC_PCCARD_CommonSpace_Timing_Init(SMC_PCCARD_TypeDef *Device,
                                                               SMC_NAND_PCC_TimingTypeDef *Timing);
DAL_StatusTypeDef  SMC_PCCARD_AttributeSpace_Timing_Init(SMC_PCCARD_TypeDef *Device,
                                                                  SMC_NAND_PCC_TimingTypeDef *Timing);
DAL_StatusTypeDef  SMC_PCCARD_IOSpace_Timing_Init(SMC_PCCARD_TypeDef *Device,
                                                           SMC_NAND_PCC_TimingTypeDef *Timing);
DAL_StatusTypeDef  SMC_PCCARD_DeInit(SMC_PCCARD_TypeDef *Device);
/**
  * @}
  */
/**
  * @}
  */
#endif /* SMC_Bank4 */


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* APM32F4xx_DDL_SMC_H */
